[
    {
      "input": "What is the duration of a soccer match?",
      "output": "A standard soccer match consists of two halves, each lasting 45 minutes, with a 15-minute halftime break. Additional stoppage time may be added at the referee's discretion."
    },
    {
      "input": "How many players are on a basketball team?",
      "output": "A basketball team has five players on the court at a time. Teams usually have additional substitutes on the bench."
    },
    {
      "input": "What is the objective of cricket?",
      "output": "The objective of cricket is to score more runs than the opposing team. The batting team aims to score runs while the bowling team tries to dismiss the batters and restrict runs."
    },
    {
        "input": "Who is Lionel Messi?",
        "output": "Lionel Messi is an Argentine professional soccer player widely regarded as one of the greatest players in the history of the sport. He has won multiple Ballon d'Or awards and has led Argentina to victories in the Copa América and the FIFA World Cup."
      },
      {
        "input": "Who holds the record for the most Grand Slam titles in tennis?",
        "output": "As of 2024, Novak Djokovic holds the record for the most men's Grand Slam titles, with 24 wins. Serena Williams leads in the modern era of women's tennis with 23 titles."
      },
      {
        "input": "What is Usain Bolt known for?",
        "output": "Usain Bolt is a retired Jamaican sprinter known for being the fastest man in the world. He holds world records in the 100m and 200m sprints and has won eight Olympic gold medals."
      },
      {
        "input": "How is a touchdown scored in American football?",
        "output": "A touchdown is scored in American football when a player carries the ball into the opponent's end zone or catches a pass in the end zone, earning the team 6 points."
      },
      {
        "input": "What is a triple-double in basketball?",
        "output": "A triple-double in basketball occurs when a player achieves double digits in three statistical categories, typically points, rebounds, and assists, in a single game."
      },
      {
        "input": "How is scoring done in volleyball?",
        "output": "In volleyball, a team scores points by grounding the ball on the opponent's side, forcing the opponent to make an error, or serving an ace. Matches are typically played in a best-of-five sets format."
      },
      {
        "input": "When was the first modern Olympic Games held?",
        "output": "The first modern Olympic Games were held in Athens, Greece, in 1896."
      },
      {
        "input": "What is the Miracle on Ice?",
        "output": "The Miracle on Ice refers to the U.S. men's ice hockey team's unexpected victory over the heavily favored Soviet Union in the 1980 Winter Olympics."
      },
      {
        "input": "Who won the FIFA World Cup in 2018?",
        "output": "France won the FIFA World Cup in 2018, defeating Croatia 4-2 in the final."
      }
  ]
  